**1) 한글 설정**

- Jupyter Notebook 시각화에 한글이 표시되게 설정합니다.

In [1]:
# 라이브러리 불러오기
import matplotlib.pyplot as plt
import matplotlib.font_manager as fm

# 폰트설정
plt.rc('font', family='Malgun Gothic')
plt.rcParams['axes.unicode_minus'] = False

**2) 라이브러리 불러오기**

- 사용할 라이브러리를 불러옵니다.

In [2]:
# 라이브러리 불러오기
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt

%config InlineBackend.figure_format = 'retina'

**3) 데이터 읽어오기**

- 다음 경로의 파일을 읽어와 test 데이터프레임을 만드세요.
- 파일 경로:
- mall_cust https://raw.githubusercontent.com/Jangrae/csv/master/mall_cust.csv
- orders https://raw.githubusercontent.com/Jangrae/csv/master/orders.csv
- Decoding 오류가 발생하면 encoding='CP949' 옵션을 지정해 읽어옵니다.

In [3]:
# 데이터 읽어오기

path = 'https://raw.githubusercontent.com/Jangrae/csv/master/orders.csv'
test = pd.read_csv(path, encoding = 'CP949')

test.head()

   OrderID  Seq   OrderDate ProductID  Qty   Amt CustomerID
0        1    1  2016-01-02  p1030071    2  7900    c107853
1        2    1  2016-01-02  p1012761    1  1700    c110521
2        2    2  2016-01-02  p1012581    1  1000    c110521
3        2    3  2016-01-02  p1175481    1  1300    c110521
4        2    4  2016-01-02  p1178011    1  8800    c110521

In [4]:
test.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 68839 entries, 0 to 68838
Data columns (total 7 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   OrderID     68839 non-null  int64
 1   Seq         68839 non-null  int64
 2   OrderDate   68839 non-null  object
 3   ProductID   68839 non-null  object
 4   Qty         68839 non-null  int64
 5   Amt         68839 non-null  int64
 6   CustomerID  68839 non-null  object
dtypes: int64(4), object(3)
memory usage: 3.7+ MB

In [5]:
test.describe()

            OrderID           Seq           Qty            Amt
count  68839.000000  68839.000000  68839.000000   68839.000000
mean      38.551519      2.082628      1.266985    2847.057990
std       23.952370      1.469644      1.372289    2634.378327
min        1.000000      1.000000      1.000000     250.000000
25%       18.000000      1.000000      1.000000    1300.000000
50%       37.000000      2.000000      1.000000    1950.000000
75%       56.000000      3.000000      1.000000    3227.000000
max      122.000000     15.000000    200.000000  109100.000000